Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རིམ་གྲོ་པ་ནི་འཇིག་རྟེན་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by the World will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་སྟོང་གི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of a Thousand Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཉམ་པར་གནས་ཞེས་བྱའོ། །
en: Abiding Evenly will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་སུམ་ཁྲི་སུམ་ཁྲིའོ། །
en: There will be thirty-one consecutive congregations of hearers, each of them gathering thirty thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: The extent of his lifespan will be nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་བདེན་སྐྱེ་བའི་ཡུལ་ནི་ལྷས་མཆོད་ཅེས་བྱའོ། །
en: “The thus-gone Satyadeva will be born in a place called Worshiped by Gods.

source: འོད་ནི་མཐའ་ཡས་སོ། །
en: His light will be infinite.

source: ཡབ་ནི་མཆོད་འོས་ཞེས་བྱའོ། །
en: Worthy of Worship will be his father.

source: ཡུམ་ནི་མཆོད་འདོད་མ་ཞེས་བྱའོ། །
en: Wishing to Worship will be his mother.

source: སྲས་ནི་ཚངས་པའི་འཁོར་ལོ་ཞེས་བྱའོ། །
en: Brahmā Wheel will be his son.

source: རིམ་གྲོ་པ་ནི་འཇིག་རྟེན་ལྷ་ཞེས་བྱའོ། །
en: God of the World will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་མཆོད་གནས་ཞེས་བྱའོ། །
en: Recipient of the World’s Worship will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་བཟངས་ཞེས་བྱའོ། །
en: Excellent Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སྟོང་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be one thousand consecutive congregations, each of them gathering six billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲི་ཆིག་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirty-one thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་བདུན་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventy-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བུའི་སྙིང་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་མཛེས་པར་བྱས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnagarbha will be born in a place called Adorned with All Excellent Qualities.

source: ཡབ་ནི་མིའི་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of Humanity will be his father.

source: ཡུམ་ནི་རིན་ཆེན་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Jewel Lamp will be his mother.

source: སྲས་ནི་ཕྱོགས་ཀྱི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Powerful Position will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་འཕེལ་ཞེས་བྱའོ། །
en: Increasing Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ངེས་ཞེས་བྱའོ། །
en: Qualities Ascertained will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་མི་འཁྲུལ་ཞེས་བྱའོ། །
en: Mind Free from Delusion will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཞི་བཅུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ལྔ་བཅུ་རྩ་གསུམ་གསུམ་མོ། །
en: There will be forty-nine consecutive congregations of hearers, each of them gathering five hundred thirty million.

source: དམ་པའི་ཆོས་ནི་ལོ་ལྔ་ཁྲི་ཆིག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for fifty-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གྲགས་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: “The thus-gone Guṇakīrti will be born in a place called Jewel Lamp.

source: ཡབ་ནི་འཕགས་པའི་ལྷ་ཞེས་བྱའོ། །
en: Superior Deity will be his father.

source: ཡུམ་ནི་ཤིན་ཏུ་མཛེས་མ་ཞེས་བྱའོ། །
en: Extremely Beautiful will be his mother.

source: རིམ་གྲོ་པ་ནི་སྤོང་དགའ་ཞེས་བྱའོ། །
en: Joyous Relinquishment will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་སེམས་དཔའ་ཞེས་བྱའོ། །
en: Wisdom Being will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དབང་ཕྱུག་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Master will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་ཕྲག་བདུན་ནོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation there will be sixty million hearers, in the second there will be seventy million, and in the third there will be eighty million.

source: སྐུ་གདུང་ནི་རིལ་པོ་གཅིག་ཏུ་འདུག་གོ། །མཆོད་རྟེན་ཡང་དཔག་ཚད་བརྒྱད་སྟོང་དྲུག་བརྒྱ་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: His relics will remain in a single collection, contained in a stūpa of eight thousand six hundred leagues.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་ཕུང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Jñānaśrī will be born in a place called Heap of Qualities.

source: ཡབ་ནི་སྐྱེ་བོའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa for Humanity will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of Qualities will be his mother.

source: སྲས་ནི་སྐལ་ལྡན་ཤིང་རྟ་ཞེས་བྱའོ། །
en: Chariot of the Fortunate will be his son.

source: རིམ་གྲོ་པ་ནི་ཉི་མའི་ལྷ་ཞེས་བྱའོ། །
en: Sun God will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Power will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་མོ། །
en: There will be twenty-two consecutive congregations of hearers, each of them gathering one trillion.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་བཅིངས་མེད་སྐྱེ་བའི་ཡུལ་ནི་འོད་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Asita will be born in a place called Infinite Light.

source: འོད་ནི་དཔག་ཚད་སུམ་ཅུ་རྩ་བཞི་པའོ། །
en: His light will extend thirty-four thousand leagues.

source: ཡབ་ནི་ཆུ་ལྷའི་ལྷ་ཞེས་བྱའོ། །
en: God of the Water Gods will be his father.

source: སྲས་ནི་དགེ་མཆོག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Supreme Virtue will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་གསལ་ཞེས་བྱའོ། །
en: Luminous Qualities will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་དུ་འོང་བར་གནས་པ་ཞེས་བྱའོ། །
en: Delightful Presence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be thirty-three consecutive congregations of hearers, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་བརྟན་སྐྱེ་བའི་ཡུལ་ནི་མ་སྨད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Dṛḍhavrata will be born in a place called Irreproachable.

source: ཡབ་ནི་སྤོས་ལྡན་ཞེས་བྱའོ། །
en: Fragrant will be his father.

source: སྲས་ནི་ཀུན་ཏུ་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Universal Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་རྣམ་པར་འཐོར་ཞེས་བྱའོ། །
en: Distributed Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་མཛོད་འཆང་ཞེས་བྱའོ། །
en: Holder of the Wisdom Treasury will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཉི་མ་ཞེས་བྱའོ། །
en: Sun of Wisdom will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be thirteen consecutive congregations of hearers, each of them gathering eight hundred million.

source: དེ་བཞིན་གཤེགས་པ་ལྷའི་གཟི་བརྗིད་སྐྱེ་བའི་ཡུལ་ནི་འགྲོ་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Maruttejas will be born in a place called Splendor of the World.

source: ཡབ་ནི་ལྷས་བསྲུངས་ཞེས་བྱའོ། །
en: Protected by Gods will be his father.

source: ཡུམ་ནི་ཐར་པ་ལྷ་ཞེས་བྱའོ། །
en: God of Liberation will be his mother.

source: སྲས་ནི་ལྷ་ལ་དད་ཅེས་བྱའོ། །
en: Faith in the Gods will be his son.

source: རིམ་གྲོ་པ་ནི་སྲིད་གསུམ་མྱ་ངན་མེད་ཅེས་བྱའོ། །
en: Free from the Suffering of the Three Worlds will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་རྩེ་མོ་ཞེས་བྱའོ། །
en: Wisdom Summit will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྙན་པར་གྲགས་ཞེས་བྱའོ། །
en: Renown will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཉིས་འབུམ་ཉིས་འབུམ་མོ། །
en: There will be seventy consecutive congregations of hearers, each of them gathering two hundred thousand.

source: དམ་པའི་ཆོས་ནི་ལོ་ཐེར་འབུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for one billion years.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པ་ཐུབ་སྐྱེ་བའི་ཡུལ་ནི་ལེགས་བསམས་གྲགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Brahmamuni will be born in a place called Famed Superior Intention.

source: ཡབ་ནི་མ་སྨད་པ་ཞེས་བྱའོ། །
en: Irreproachable will be his father.

source: ཡུམ་ནི་དབང་པོ་དུལ་ཞེས་བྱའོ། །
en: Sense Control will be his mother.

source: སྲས་ནི་ཕྱག་དགའ་ཞེས་བྱའོ། །
en: Hand of Joy will be his son.

source: རིམ་གྲོ་པ་ནི་ཞི་གནས་དགའ་ཞེས་བྱའོ། །
en: Delighting in Calm Abiding will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མེ་ཏོག་དགའ་ཞེས་བྱའོ། །
en: Flower Joy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དབྱངས་སྙན་ཞེས་བྱའོ། །
en: Beautiful Melody will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be twenty-four consecutive congregations of hearers, each of them gathering one billion.

source: དམ་པའི་ཆོས་ནི་ལོ་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain four thousand years.

source: དེ་བཞིན་གཤེགས་པ་དལ་གྱིས་བཞུད་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བས་འགྲོ་ཞེས་བྱའོ། །
en: “The thus-gone Śanairgāmin will be born in a place called Moving with Joy.

source: ཡབ་ནི་ཡོན་ཏན་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Qualities will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་གྱི་ཚོགས་ཞེས་བྱའོ། །
en: Gathering of Qualities will be his mother.

source: སྲས་ནི་ཀུན་ཏུ་གསལ་ཞེས་བྱའོ། །
en: Luminous will be his son.

source: རིམ་གྲོ་པ་ནི་ཚོགས་དབྱངས་ཞེས་བྱའོ། །
en: Gathering Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་གྲགས་མཛེས་ཞེས་བྱའོ། །
en: Beautiful Fame of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཀུན་འབྱུང་ཞེས་བྱའོ། །
en: Source of All Excellent Qualities will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be ninety consecutive congregations of hearers, each of them gathering one million six hundred thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་ཁྲི་བདུན་སྟོང་ངོ་། །
en: The extent of his lifespan will be fifty-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་དཀའ་ཐུབ་སྐྱེ་བའི་ཡུལ་ནི་འོད་ཆེན་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Vratatapas will be born in a place called Great Light.

source: ཡབ་ནི་འོད་ཟེར་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Radiance will be his father.

source: ཡུམ་ནི་ཡིད་འོང་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Attractive Splendor will be his mother.

source: སྲས་ནི་བཞིན་མ་ཞུམ་ཞེས་བྱའོ། །
en: Undaunted Visage will be his son.

source: རིམ་གྲོ་པ་ནི་ངོམས་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Untiring Intellect will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཚོགས་ཞེས་བྱའོ། །
en: Gathering of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲིབ་མེད་མ་རྨོངས་པ་ཞེས་བྱའོ། །
en: Unobscured Absence of Ignorance will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be sixteen consecutive congregations of hearers, each of them gathering one trillion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixty-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཕུང་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཀླུ་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Arciskandha will be born in a place called Nāga Light.

source: ཡབ་ནི་འོད་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Light will be his father.

source: ཡུམ་ནི་འཇིག་རྟེན་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Lamp of the World will be his mother.

source: རིམ་གྲོ་པ་ནི་གཟི་བརྗིད་ཐུལ་ཞེས་བྱའོ། །
en: Overpowering Splendor will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་པད་མའི་དྲི་ཞེས་བྱའོ། །
en: Lotus Fragrance will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐུབ་པ་མེད་པའི་མཐུ་ཞེས་བྱའོ། །
en: Indomitable Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཉི་ཁྲི་ཉི་ཁྲིའོ། །
en: There will be sixteen consecutive congregations of hearers, each of them gathering twenty thousand.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཆེན་པོ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཁྱད་པར་དུ་འཕགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Mahātejas will be born in a place called Extraordinary Splendor.

source: ཡབ་ནི་འགྲོས་བརྟན་ཞེས་བྱའོ། །
en: Stable Mode will be his father.

source: ཡུམ་ནི་དབང་སྒྱུར་མ་ཞེས་བྱའོ། །
en: Controller will be his mother.

source: སྲས་ནི་འོད་གསལ་ཞེས་བྱའོ། །
en: Luminosity will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་ཕུང་པོ་ཞེས་བྱའོ། །
en: Aggregate of Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོག་གི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Supreme Intelligence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be ten consecutive congregations of hearers, each of them gathering three billion.

source: དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀ་སྐྱེ་བའི་ཡུལ་ནི་སྤོས་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Campaka will be born in a place called Endowed with Incense.

source: ཡབ་ནི་བསོད་ནམས་འོད་ཅེས་བྱའོ། །
en: Light of Merit will be his father.

source: ཡུམ་ནི་མཐོང་ན་ཡིད་འོང་ཞེས་བྱའོ། །
en: Delightful to See will be his mother.

source: སྲས་ནི་སེང་གེའི་ལྟ་སྟངས་ཞེས་བྱའོ། །
en: Lion Gaze will be his son.

source: རིམ་གྲོ་པ་ནི་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཞེས་བྱའོ། །
en: Elephant Gaze will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱལ་མཆོག་ཅེས་བྱའོ། །
en: Supreme King will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་རྒྱལ་ཞེས་བྱའོ། །
en: Victorious Merit will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བྱེ་བ་ཕྲག་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་དགུ་བཅུ་དགུའོ། །
en: There will be one hundred million consecutive congregations of hearers, each of them gathering one hundred ninety million.

source: དེ་བཞིན་གཤེགས་པ་དགའ་མཛད་སྐྱེ་བའི་ཡུལ་ནི་དགའ་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Toṣaṇa will be born in a place called Supreme Joy.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པ་བཅྭ་ལྔ་ཙམ་མོ། །
en: His light will extend as far as fifteen times the four continents.

source: ཡབ་ནི་དགའ་འོད་ཅེས་བྱའོ། །
en: Light of Joy will be his father.

source: ཡུམ་ནི་མཆོད་འོས་མ་ཞེས་བྱའོ། །
en: Worthy of Worship will be his mother.

source: སྲས་ནི་ཀླུ་སྤོས་ཞེས་བྱའོ། །
en: Nāga Incense will be his son.

source: རིམ་གྲོ་པ་ནི་ཚུལ་ཁྲིམས་འོད་ཅེས་བྱའོ། །
en: Light of Discipline will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་སྨྲ་དབྱངས་ཞེས་བྱའོ། །
en: Melody of True Speech will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་སྨྲ་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Dharma Speech will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་བརྒྱད་སྟོང་བརྒྱད་སྟོང་ངོ་། །
en: There will be sixteen consecutive congregations of hearers, each of them gathering eighty million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ལྔ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for fifty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་བཟང་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཚོགས་ལྡན་གསལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Sugaṇin will be born in a place called Clear Possession of Gatherings.

source: ཡབ་ནི་ཉི་མའི་ཏོག་ཅེས་བྱའོ། །
en: Sun Crest will be his father.

source: སྲས་ནི་འགྲོས་མཛེས་ཞེས་བྱའོ། །
en: Beautiful Mode will be his son.

source: རིམ་གྲོ་པ་ནི་ནོར་ལྷའི་བུ་དགའ་ཞེས་བྱའོ། །
en: Joyful Child of the Wealth God will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བྱང་ཆུབ་དགའ་ཞེས་བྱའོ། །
en: Joy of Awakening will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Merit will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be forty consecutive congregations of hearers, each of them gathering seven hundred million.

source: དེ་བཞིན་གཤེགས་པ་དབང་པོའི་རྒྱལ་མཚན་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: “The thus-gone Indradhvaja will be born in a place called Jewel Banner.

source: ཡབ་ནི་བསོད་ནམས་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Merit Banner will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Excellent Qualities will be his mother.

source: སྲས་ནི་ཆོས་ཀྱི་བློ་ཞེས་བྱའོ། །
en: Dharma Mind will be his son.

source: རིམ་གྲོ་པ་ནི་འཁྲུལ་མེད་བློ་ཞེས་བྱའོ། །
en: Mind Free from Delusion will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་འོང་སེམས་ཞེས་བྱའོ། །
en: Beautiful Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་བའི་ཚོགས་ཞེས་བྱའོ། །
en: Gathering of Virtue will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be sixteen consecutive congregations of hearers, each of them gathering eight hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་འབུམ་མོ། །
en: The extent of his lifespan will be seven hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་དགྱེས་པ་ཆེན་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་སྟོང་སྙེད་སྣང་ཞེས་བྱའོ། །
en: “The thus-gone Mahāpriya will be born in a place called Light of Thousands of Qualities.

source: ཡབ་ནི་མཛོད་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Treasury will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་འཇིགས་མེད་མ་ཞེས་བྱའོ། །
en: Fearless Wisdom will be his mother.

source: སྲས་ནི་བྱང་ཆུབ་སེམས་ཞེས་བྱའོ། །
en: Mind of Awakening will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མ་སྨད་གྲགས་པ་ཞེས་བྱའོ། །
en: Fame Beyond Reproach will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་འོང་འདོད་ཅེས་བྱའོ། །
en: Beautiful Wish will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be twenty-one consecutive congregations of hearers, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་སྣ་མའི་མེ་ཏོག་འོད་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Sumanā­puṣpa­prabha will be born in a place called Flower Splendor.

source: སྲས་ནི་མེ་ཏོག་ཟླ་བ་ཞེས་བྱའོ། །
en: Flower Moon will be his son.

source: རིམ་གྲོ་པ་ནི་མེ་ཏོག་གི་ཏོག་ཅེས་བྱའོ། །
en: Flower Crest will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་པད་མ་དཀར་པོའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: White Lotus Essence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སྟོང་སྟེ། ཐམས་ཅད་ལ་ཡང་དྲུག་འབུམ་དྲུག་ཁྲི་དྲུག་ཁྲིའོ། །
en: There will be one thousand consecutive congregations of hearers, each of them gathering six hundred sixty thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: The extent of his lifespan will be eight hundred million years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དུང་ཕྱུར་ཕྲག་བརྒྱད་ཀྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for eight hundred million years.

source: དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་འོད་སྐྱེ་བའི་ཡུལ་ནི་ཁ་ལོ་སྒྱུར་བའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Gaṇiprabha will be born in a place called Leader Light.

source: ཡབ་ནི་ཡོན་ཏན་འོད་ཅེས་བྱའོ། །
en: Luminous Qualities will be his father.

source: སྲས་ནི་བསོད་ནམས་གསལ་ཞེས་བྱའོ། །
en: Luminous Merit will be his son.

source: རིམ་གྲོ་པ་ནི་གྲགས་པ་གསལ་ཞེས་བྱའོ། །
en: Luminous Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་གསལ་ཞེས་བྱའོ། །
en: Luminous Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཕགས་པ་གསལ་ཞེས་བྱའོ། །
en: Luminous Superior will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་དགུ་ཁྲི་དགུ་ཁྲིའོ། །
en: There will be sixteen consecutive congregations of hearers, each of them gathering ninety thousand.

source: དེ་བཞིན་གཤེགས་པ་སྐྲུན་པར་མཛད་པ་སྐྱེ་བའི་ཡུལ་ནི་ཤིན་ཏུ་མཛེས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Creator will be born in a place called Exceptionally Beautiful.

source: འོད་ནི་དཔག་ཚད་བཞི་བཅུ་རྩ་གཉིས་སོ། །
en: His light will extend forty-two leagues.

source: ཡབ་ནི་ཁུར་སྟོབས་ཅན་ཞེས་བྱའོ། །
en: Powerful Load will be his father.

source: ཡུམ་ནི་ཉི་མ་ཅན་ཞེས་བྱའོ། །
en: Sun Possessor will be his mother.

source: སྲས་ནི་གྲགས་པའི་དབང་པོ་ཞེས་བྱའོ། །
en: Master of Fame will be his son.

source: རིམ་གྲོ་པ་ནི་ཏོག་གི་ཕུང་པོ་ཞེས་བྱའོ། །
en: Mountain Crest will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་དཔལ་ཞེས་བྱའོ། །
en: Glorious Jewel will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་དཔལ་ཞེས་བྱའོ། །
en: Glorious Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be thirteen consecutive congregations of hearers, each of them gathering one billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་བརྒྱའོ། །
en: The extent of his lifespan will be six hundred years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་བརྒྱའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for six hundred years.

source: དེ་བཞིན་གཤེགས་པ་མདངས་འགྲོ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Ojaṅgama will be born in a place called Delightful Array.

source: ཡབ་ནི་སེང་གེས་རྣམ་པར་རོལ་པ་ཞེས་བྱའོ། །
en: Reveling Lion will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Qualities will be his mother.

source: སྲས་ནི་མཐའ་ཡས་མིག་ཅེས་བྱའོ། །
en: Infinite Eye will be his son.

source: རིམ་གྲོ་པ་ནི་བརྩོན་འགྲུས་མི་གཏོང་བ་ཞེས་བྱའོ། །
en: Unrelenting Diligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་འགྲུས་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Diligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་མཐུ་རྩལ་ཅན་ཞེས་བྱའོ། །
en: Possessor of Universal Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be twenty-one consecutive congregations of hearers, each of them gathering one billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲི་དགུ་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixty-nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་དོན་ལེགས་ངེས་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་ངེས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Suviniścitārtha will be born in a place called Definite Qualities.

source: འོད་ནི་དཔག་ཚད་དགུ་བཅུ་རྩ་དགུའོ། །
en: His light will extend ninety-nine leagues.

source: ཡབ་ནི་དོན་གྱི་ཡོན་ཏན་ཞེས་བྱའོ། །
en: Ultimate Qualities will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་དཔག་མེད་མ་ཞེས་བྱའོ། །
en: Immeasurable Splendor will be his mother.

source: སྲས་ནི་གྲགས་པ་དཔག་མེད་ཅེས་བྱའོ། །
en: Immeasurable Fame will be his son.

source: རིམ་གྲོ་པ་ནི་མཐུ་རྩལ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོ་བའི་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Friend of Wandering Beings will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་དཔག་ཏུ་མེད་ཅེས་བྱའོ། །
en: Immeasurable Splendor will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be six consecutive congregations of hearers, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཁྱུ་མཆོག་སྐྱེ་བའི་ཡུལ་ནི་ལྷས་མཆོད་ཅེས་བྱའོ། །
en: “The thus-gone Vṛṣabha will be born in a place called Worshiped by Gods.

source: ཡབ་ནི་ས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Ground will be his father.

source: སྲས་ནི་ཐུབ་མེད་སྡེ་ཞེས་བྱའོ། །
en: Invincible Army will be his son.

source: རིམ་གྲོ་པ་ནི་ཀུན་ཏུ་མཐུ་རྩལ་ཅན་ཞེས་བྱའོ། །
en: Universal Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷས་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by Gods will be foremost in terms of insight.
